In [1]:
import pandas as pd
data = [['A', 'Math'], ['B', 'English'], ['C', 'Math'], ['D', 'Biology'], ['E', 'Math'], ['F', 'Computer'], ['G', 'Math'], ['H', 'Math'], ['I', 'Math']]
courses = pd.DataFrame(data, columns=['student', 'class']).astype({'student':'object', 'class':'object'})
courses

  student     class
0       A      Math
1       B   English
2       C      Math
3       D   Biology
4       E      Math
5       F  Computer
6       G      Math
7       H      Math
8       I      Math

In [19]:
courses.columns

Index(['student', 'class'], dtype='object')

In [2]:
grouped_courses = courses.groupby('class')
grouped_courses

In [3]:
for key, value in grouped_courses:
    print(key)
    print(value)

Biology
  student    class
3       D  Biology
Computer
  student     class
5       F  Computer
English
  student    class
1       B  English
Math
  student class
0       A  Math
2       C  Math
4       E  Math
6       G  Math
7       H  Math
8       I  Math

In [4]:
grouped_courses_student = courses.groupby('class')['student']
grouped_courses_student

In [5]:
for key, value in grouped_courses_student:
    print(key)
    print(value)

Biology
3    D
Name: student, dtype: object
Computer
5    F
Name: student, dtype: object
English
1    B
Name: student, dtype: object
Math
0    A
2    C
4    E
6    G
7    H
8    I
Name: student, dtype: object

In [6]:
grouped_courses_student_sum = courses.groupby('class')['student'].sum()
grouped_courses_student_sum

class
Biology          D
Computer         F
English          B
Math        ACEGHI
Name: student, dtype: object

In [7]:
grouped_courses_student_sum_strlen = courses.groupby('class')['student'].sum().str.len()
grouped_courses_student_sum_strlen

class
Biology     1
Computer    1
English     1
Math        6
Name: student, dtype: int64

In [8]:
grouped_courses_student_sum_strlen_toframe = courses.groupby('class')['student'].sum().str.len().to_frame()
grouped_courses_student_sum_strlen_toframe

          student
class
Biology         1
Computer        1
English         1
Math            6

In [9]:
grouped_courses_student_sum_strlen_toframe.columns

Index(['student'], dtype='object')

In [10]:
grouped_courses_student_sum_strlen_toframe['student']

class
Biology     1
Computer    1
English     1
Math        6
Name: student, dtype: int64

In [29]:
grouped_courses_student_sum_strlen_resetindex = courses.groupby('class')['student'].sum().str.len().reset_index()
grouped_courses_student_sum_strlen_resetindex

      class  student
0   Biology        1
1  Computer        1
2   English        1
3      Math        6

In [35]:
grouped_courses_student_sum_strlen_resetindex.dtypes

class      object
student     int64
dtype: object

In [42]:
grouped_courses_student_sum_strlen_resetindex.loc[grouped_courses_student_sum_strlen_resetindex['student']>=5,['class']]

  class
3  Math

In [45]:
courses.groupby('class')['student'].sum().str.len().reset_index().loc[grouped_courses_student_sum_strlen_resetindex['student']>=5,['class']]

  class
3  Math

In [30]:
grouped_courses_student_nunique = courses.groupby('class')['student'].nunique()
grouped_courses_student_nunique

class
Biology     1
Computer    1
English     1
Math        6
Name: student, dtype: int64

In [31]:
grouped_courses_student_nunique_resetindex = courses.groupby('class')['student'].nunique().reset_index()
grouped_courses_student_nunique_resetindex

      class  student
0   Biology        1
1  Computer        1
2   English        1
3      Math        6

In [36]:
grouped_courses_student_nunique_resetindex.dtypes

class      object
student     int64
dtype: object

In [43]:
grouped_courses_student_nunique_resetindex.loc[grouped_courses_student_nunique_resetindex['student']>=5,['class']]

  class
3  Math

In [44]:
courses.groupby('class')['student'].nunique().reset_index().loc[grouped_courses_student_nunique_resetindex['student']>=5,['class']]

  class
3  Math